tsung_scripts/tsung_combined_50k.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd" [] >
<tsung loglevel="notice">
	<clients>
		<client host="localhost" maxusers="32768" use_controller_vm="true" />
	</clients>

	<servers>
		<server host="saikumar.eba-fbpd2mid.us-west-2.elasticbeanstalk.com" port="80" type="tcp"></server>
	</servers>

	<load>
		<arrivalphase phase="1" duration="60" unit="second">
			<users arrivalrate="2" unit="second"></users>
		</arrivalphase>
		<arrivalphase phase="2" duration="60" unit="second">
			<users arrivalrate="4" unit="second"></users>
		</arrivalphase>
		<arrivalphase phase="3" duration="60" unit="second">
			<users arrivalrate="8" unit="second"></users>
		</arrivalphase>
		<arrivalphase phase="4" duration="60" unit="second">
			<users arrivalrate="16" unit="second"></users>
		</arrivalphase>
		<arrivalphase phase="5" duration="60" unit="second">
			<users arrivalrate="32" unit="second"></users>
		</arrivalphase>
		<arrivalphase phase="6" duration="60" unit="second">
			<users arrivalrate="64" unit="second"></users>
		</arrivalphase>
		<arrivalphase phase="7" duration="60" unit="second">
			<users arrivalrate="128" unit="second"></users>
		</arrivalphase>
	</load>

	<options>
		<!-- Set connection timeout to 3 seconds -->
		<option name="global_ack_timeout" value="3000"></option>
	</options>

	<sessions>
		<session name="root" type="ts_http" probability="35">

			<request>
				<dyn_variable name="authenticity_token"></dyn_variable>
				<http method="GET" url="/buyers/sign_in"></http>
			</request>

			<setdynvars code='fun({Pid,DynVars})->{ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),re:replace(Val,"[+]","%2B",[global,{return,list}]) end.' sourcetype="eval">
				<var name="authenticity_token" />
			</setdynvars>

			<request subst="true">
				<http url="/buyers/sign_in" version="1.1" method="POST"
					contents="buyer[email]=buyer1@example.com&amp;authenticity_token=%%_authenticity_token%%&amp;
					buyer[password]=password&amp;commit=Log+in"
					content_type="application/x-www-form-urlencoded"></http>
			</request>

			<request>
				<http method="GET" url="/"></http>
			</request>

			<thinktime value="1" random="true"></thinktime>

		</session>

		<session name="buyer_workflow" type="ts_http" probability="25">
			<setdynvars sourcetype="random_number" start="1" end="5">
				<var name="rand_buyer"/>
			</setdynvars>

			<request>
				<dyn_variable name="authenticity_token"></dyn_variable>
				<http method="GET" url="/buyers/sign_in"></http>
			</request>

			<setdynvars code='fun({Pid,DynVars})->{ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),re:replace(Val,"[+]","%2B",[global,{return,list}]) end.' sourcetype="eval"> <var name="authenticity_token" /> </setdynvars>

			<request subst="true">
				<http url="/buyers/sign_in" version="1.1" method="POST"
					contents="buyer[email]=buyer%%_rand_buyer%%@example.com&amp;authenticity_token=%%_authenticity_token%%&amp;
					buyer[password]=password&amp;commit=Log+in"
					content_type="application/x-www-form-urlencoded">
				</http>
			</request>

			<setdynvars sourcetype="random_number" start="1" end="50000">
				<var name="rand_item"/>
			</setdynvars>

			<request subst ="true">
				<http url="/items/%%_rand_item%%" version="1.1" method="GET"
					contents="authenticity_token=%%_authenticity_token%%"
					content_type="application/x-www-form-urlencoded">
				</http>
			</request>

			<thinktime value="5" random="true"></thinktime>

			<request subst="true">
				<http url="/cart/%%_rand_item%%" version="1.1" method="POST"
					contents="authenticity_token=%%_authenticity_token%%"
					content_type="application/x-www-form-urlencoded">
				</http>
			</request>

			<request>
				<dyn_variable name="authenticity_token"></dyn_variable>
				<http method="GET" url="/showcart"></http>
			</request>
			<setdynvars code='fun({Pid,DynVars})->{ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),re:replace(Val,"[+]","%2B",[global,{return,list}]) end.' sourcetype="eval"> <var name="authenticity_token" /> </setdynvars>

		</session>

		<session name="buyer_login" type="ts_http" probability="20">
			<setdynvars sourcetype="random_number" start="1" end="100">
				<var name="rand_buyer"/>
			</setdynvars>

			<request>
				<dyn_variable name="authenticity_token"></dyn_variable>
				<http method="GET" url="/buyers/sign_in"></http>
			</request>

	        <setdynvars code='fun({Pid,DynVars})->{ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),re:replace(Val,"[+]","%2B",[global,{return,list}]) end.' sourcetype="eval"> <var name="authenticity_token" /> </setdynvars>

			<request subst="true">
				<http url="/buyers/sign_in" version="1.1" method="POST"
					contents="buyer[email]=buyer%%_rand_buyer%%@example.com&amp;authenticity_token=%%_authenticity_token%%&amp;
					buyer[password]=password&amp;commit=Log+in"
					content_type="application/x-www-form-urlencoded">
				</http>
			</request>

			<setdynvars sourcetype="random_number" start="25001" end="50000">
				<var name="item_1"/>
			</setdynvars>
			<setdynvars sourcetype="random_number" start="25001" end="50000">
				<var name="item_2"/>
			</setdynvars>

			<request subst="true">
				<http url="/cart/%%_item_1%%" version="1.1" method="POST"
					contents="authenticity_token=%%_authenticity_token%%"
					content_type="application/x-www-form-urlencoded">
				</http>
			</request>

			<request subst="true">
				<http url="/cart/%%_item_2%%" version="1.1" method="POST"
					contents="authenticity_token=%%_authenticity_token%%"
					content_type="application/x-www-form-urlencoded">
				</http>
			</request>

			<request>
				<dyn_variable name="authenticity_token"></dyn_variable>
				<http method="GET" url="/showcart"></http>
			</request>

			<setdynvars code='fun({Pid,DynVars})->{ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),re:replace(Val,"[+]","%2B",[global,{return,list}]) end.' sourcetype="eval"> <var name="authenticity_token" /> </setdynvars>

			<request subst="true">
				<http url="/orderplaced" version="1.1" method="POST"
					contents="authenticity_token=%%_authenticity_token%%&amp;
					helo=%%_authenticity_token%%&amp;requestparam=%7B%22body%22%3A%5B%7B%22item_id%22%3A%22300%22%2C%22quantity%22%3A%221%22%7D%5D%7D"
					content_type="application/x-www-form-urlencoded">
				</http>
			</request>
		</session>

		<session name="buyer_rates" type="ts_http" probability="15">
			<setdynvars sourcetype="random_number" start="1" end="5">
				<var name="rand_buyer"/>
			</setdynvars>

			<request>
				<dyn_variable name="authenticity_token"></dyn_variable>
				<http method="GET" url="/buyers/sign_in"></http>
			</request>

			<thinktime value='1' random='true'/>

			<setdynvars code='fun({Pid,DynVars})->{ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),re:replace(Val,"[+]","%2B",[global,{return,list}]) end.' sourcetype="eval"> <var name="authenticity_token" /> </setdynvars>

			<request subst="true">
				<http url="/buyers/sign_in" version="1.1" method="POST"
					contents="buyer[email]=buyer%%_rand_buyer%%@example.com&amp;authenticity_token=%%_authenticity_token%%&amp;
					buyer[password]=password&amp;commit=Log+in"
					content_type="application/x-www-form-urlencoded">
				</http>
			</request>

			<request subst="true">
				<http url="/orders" version="1.1" method="GET"
					contents="authenticity_token=%%_authenticity_token%%"
					content_type="application/x-www-form-urlencoded">
				</http>
			</request>

			<thinktime value='1' random='true'/>

			<setdynvars sourcetype="random_number" start="1" end="2500">
				<var name="rand_order"/>
			</setdynvars>

			<request subst="true">
				<http url="/ratings/%%_rand_order%%" version="1.1" method="GET"
					contents="authenticity_token=%%_authenticity_token%%"
					content_type="application/x-www-form-urlencoded">
				</http>
			</request>

			<request subst="true">
				<http url="/ratings/%%_rand_order%%" version="1.1" method="POST"
					contents="stars=3&amp;authenticity_token=%%_authenticity_token%%&amp;
					comment=average&amp;commit=Submit+This+Rating"
					content_type="application/x-www-form-urlencoded">
				</http>
			</request>
		</session>

		<session name="seller_workflow" type="ts_http" probability="5">
			<request>
				<dyn_variable name="authenticity_token"></dyn_variable>
				<http method="GET" url="/sellers/sign_in"></http>
			</request>

			<setdynvars code='fun({Pid,DynVars})->{ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),re:replace(Val,"[+]","%2B",[global,{return,list}]) end.' sourcetype="eval"> <var name="authenticity_token" /> </setdynvars>

			<request subst="true">
				<http url="/sellers/sign_in" version="1.1" method="POST"
					contents="seller[email]=seller1@example.com&amp;authenticity_token=%%_authenticity_token%%&amp;
					seller[password]=password&amp;commit=Log+in"
					content_type="application/x-www-form-urlencoded">
				</http>
			</request>

			<thinktime value='2' random='true'/>

			<request>
				<http method="GET" url="/profile/seller"></http>
			</request>


			<request>
				<dyn_variable name="authenticity_token"></dyn_variable>
				<http method="GET" url="/items/new"></http>
			</request>

			<setdynvars sourcetype="random_number" start="1" end="10000">
				<var name="uid_prefix"/>
			</setdynvars>

			<thinktime value='2' random='true'/>

			<request subst="true">
				<http url="/items" version="1.1" method="POST"
					contents="item[name]=Tsung_test_%%_uid_prefix%%&amp;authenticity_token=%%_authenticity_token%%&amp;
					item[description]=Tsung_test_description_for_%%_uid_prefix%%&amp;item[price]=999&amp;commit=Register+Product"
					content_type="application/x-www-form-urlencoded">
				</http>
			</request>

			<thinktime value='1' random='true'/>

			<request>
				<http method="GET" url="/"></http>
			</request>

			<thinktime value='1' random='true'/>

			<request>
				<http method="GET" url="/profile/seller"></http>
			</request>
		</session>
	</sessions>
</tsung>